Revit 2026 API
PointCloudFilterFactory Class
 A factory class for creating point cloud filters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class PointCloudFilterFactory
Public NotInheritable Class PointCloudFilterFactory
public ref class PointCloudFilterFactory abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PointCloudFilterFactory = class end
The PointCloudFilterFactory type exposes the following members.
Methods
Name | Description
CreateMultiPlaneFilter(IList<Plane>)
CreateMultiPlaneFilter(IList<Plane>, Int32)
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace